7767517
38 42
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=8 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=72 9=1
Convolution              convrelu_1               1 1 1 2 0=8 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Split                    splitncnn_0              1 2 2 3 4
ConvolutionDepthWise     convdw_27                1 1 4 5 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72 7=8
Convolution              convrelu_2               1 1 5 6 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128 9=1
ConvolutionDepthWise     convdw_28                1 1 6 7 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16
Convolution              conv_3                   1 1 7 8 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Convolution              conv_4                   1 1 3 9 0=16 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=128
Pooling                  maxpool2d_15             1 1 8 10 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
BinaryOp                 add_0                    2 1 9 10 11 0=0
Split                    splitncnn_1              1 2 11 12 13
ConvolutionDepthWise     convdw_29                1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16
Convolution              convrelu_3               1 1 14 15 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
ConvolutionDepthWise     convdw_30                1 1 15 16 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Convolution              conv_6                   1 1 16 17 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Convolution              conv_7                   1 1 12 18 0=32 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=512
Pooling                  maxpool2d_16             1 1 17 19 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
BinaryOp                 add_1                    2 1 18 19 20 0=0
Split                    splitncnn_2              1 2 20 21 22
ConvolutionDepthWise     convdw_31                1 1 22 23 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Convolution              convrelu_4               1 1 23 24 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
ConvolutionDepthWise     convdw_32                1 1 24 25 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              conv_9                   1 1 25 26 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_10                  1 1 21 27 0=64 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2048
Pooling                  maxpool2d_17             1 1 26 28 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
BinaryOp                 add_2                    2 1 27 28 29 0=0
Split                    splitncnn_3              1 2 29 30 31
ConvolutionDepthWise     convdw_33                1 1 31 32 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              convrelu_5               1 1 32 33 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
ConvolutionDepthWise     convdw_34                1 1 33 34 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              conv_12                  1 1 34 35 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Convolution              conv_13                  1 1 30 36 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=8192
Pooling                  maxpool2d_18             1 1 35 37 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
BinaryOp                 add_3                    2 1 36 37 38 0=0
Convolution              conv_14                  1 1 38 39 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=11520
Reduction                mean_26                  1 1 39 40 0=3 1=0 -23303=2,-1,-2 4=0 5=1
Softmax                  softmax_25               1 1 40 out0 0=0 1=1
